## Terraform Plan Results

**PR:** #9
**Branch:** one_p
**Commit:** 5887291db0fe98156aff8b8acfce64dbeacebec1

```
## Hub: hub1
data.azurerm_resource_group.vwan: Reading...
data.azurerm_resource_group.vwan: Read complete after 0s [id=/subscriptions/306b4bc8-c519-4de9-8286-cf3f3c597a1c/resourceGroups/rg-vwan-prod]
data.azurerm_virtual_wan.vwan: Reading...
data.azurerm_virtual_wan.vwan: Read complete after 1s [id=/subscriptions/306b4bc8-c519-4de9-8286-cf3f3c597a1c/resourceGroups/rg-vwan-prod/providers/Microsoft.Network/virtualWans/vwan-prod]
azurerm_virtual_hub.hub: Refreshing state... [id=/subscriptions/306b4bc8-c519-4de9-8286-cf3f3c597a1c/resourceGroups/rg-vwan-prod/providers/Microsoft.Network/virtualHubs/hub1-prod]
azurerm_express_route_gateway.express_route_gateway[0]: Refreshing state... [id=/subscriptions/306b4bc8-c519-4de9-8286-cf3f3c597a1c/resourceGroups/rg-vwan-prod/providers/Microsoft.Network/expressRouteGateways/ergw1-prod]
azurerm_vpn_gateway.vpn_gateway[0]: Refreshing state... [id=/subscriptions/306b4bc8-c519-4de9-8286-cf3f3c597a1c/resourceGroups/rg-vwan-prod/providers/Microsoft.Network/vpnGateways/vpngw1-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_express_route_gateway.express_route_gateway[0] must be replaced
-/+ resource "azurerm_express_route_gateway" "express_route_gateway" {
      ~ id                            = "/subscriptions/306b4bc8-c519-4de9-8286-cf3f3c597a1c/resourceGroups/rg-vwan-prod/providers/Microsoft.Network/expressRouteGateways/ergw1-prod" -> (known after apply)
        name                          = "ergw1-prod"
      - tags                          = {} -> null
      ~ virtual_hub_id                = "/subscriptions/306b4bc8-c519-4de9-8286-cf3f3c597a1c/resourceGroups/rg-vwan-prod/providers/Microsoft.Network/virtualHubs/hub1-prod" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # azurerm_virtual_hub.hub must be replaced
-/+ resource "azurerm_virtual_hub" "hub" {
      ~ address_prefix                         = "192.0.0.0/16" -> "192.168.0.0/16" # forces replacement
      ~ default_route_table_id                 = "/subscriptions/306b4bc8-c519-4de9-8286-cf3f3c597a1c/resourceGroups/rg-vwan-prod/providers/Microsoft.Network/virtualHubs/hub1-prod/hubRouteTables/defaultRouteTable" -> (known after apply)
      ~ id                                     = "/subscriptions/306b4bc8-c519-4de9-8286-cf3f3c597a1c/resourceGroups/rg-vwan-prod/providers/Microsoft.Network/virtualHubs/hub1-prod" -> (known after apply)
        name                                   = "hub1-prod"
      - tags                                   = {} -> null
      ~ virtual_router_asn                     = 65515 -> (known after apply)
      ~ virtual_router_ips                     = [
          - "192.0.32.6",
          - "192.0.32.5",
        ] -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_vpn_gateway.vpn_gateway[0] must be replaced
-/+ resource "azurerm_vpn_gateway" "vpn_gateway" {
      ~ id                                    = "/subscriptions/306b4bc8-c519-4de9-8286-cf3f3c597a1c/resourceGroups/rg-vwan-prod/providers/Microsoft.Network/vpnGateways/vpngw1-prod" -> (known after apply)
      ~ ip_configuration                      = [
          - {
              - id                 = "Instance0"
              - private_ip_address = "192.0.0.4"
              - public_ip_address  = "172.171.189.241"
            },
          - {
              - id                 = "Instance1"
              - private_ip_address = "192.0.0.5"
              - public_ip_address  = "51.8.29.180"
            },
        ] -> (known after apply)
        name                                  = "vpngw1-prod"
      - tags                                  = {} -> null
      ~ virtual_hub_id                        = "/subscriptions/306b4bc8-c519-4de9-8286-cf3f3c597a1c/resourceGroups/rg-vwan-prod/providers/Microsoft.Network/virtualHubs/hub1-prod" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)

      ~ bgp_settings (known after apply)
      - bgp_settings {
          - asn                 = 65515 -> null
          - peer_weight         = 0 -> null
            # (1 unchanged attribute hidden)

          - instance_0_bgp_peering_address {
              - custom_ips          = [] -> null
              - default_ips         = [
                  - "192.0.0.12",
                ] -> null
              - ip_configuration_id = "Instance0" -> null
              - tunnel_ips          = [
                  - "172.171.189.241",
                  - "192.0.0.4",
                ] -> null
            }

          - instance_1_bgp_peering_address {
              - custom_ips          = [] -> null
              - default_ips         = [
                  - "192.0.0.13",
                ] -> null
              - ip_configuration_id = "Instance1" -> null
              - tunnel_ips          = [
                  - "192.0.0.5",
                  - "51.8.29.180",
                ] -> null
            }
        }
    }

Plan: 3 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

---
```
